#         7
#       3   8
#     8   1   0
#   2   7   4   4
# 4   5   2   6   5
# 위 그림은 크기가 5인 정수 삼각형의 한 모습이다.
#
# 맨 위층 7부터 시작해서 아래에 있는 수 중 하나를 선택하여 아래층으로 내려올 때, 이제까지 선택된 수의 합이 최대가 되는 경로를 구하는 프로그램을 작성하라. 아래층에 있는 수는 현재 층에서 선택된 수의 대각선 왼쪽 또는 대각선 오른쪽에 있는 것 중에서만 선택할 수 있다.
#
# 삼각형의 크기는 1 이상 500 이하이다. 삼각형을 이루고 있는 각 수는 모두 정수이며, 범위는 0 이상 9999 이하이다.

if __name__ == "__main__":
    n = int(input())
    dp = []
    for _ in range(n):
        dp.append(list(map(int, input().split())))

    for i in range(1, n):
        for j in range(len(dp[i])):
            if j == 0:
                dp[i][j] = dp[i-1][j] +dp[i][j]
            elif j == len(dp[i])-1:
                dp[i][j] = dp[i-1][j-1] + dp[i][j]
            else:
                dp[i][j] = max(dp[i-1][j-1], dp[i-1][j]) + dp[i][j]
    print(max(dp[n-1]))

# 문제를 푸는데 손코딩하면서 10~20분 정도 걸렸던 문제였다.
# 동적계획법으로 코드를 어떻게 작성해야할지 알게된 좋은 문제였다.