# 10년 전, 홍익대학교 학생을 위한 댄스파티가 개최되었다.
#
#  	도약 준비	도약 중	착석
# 1	.	o	.
# 2	o	w	.
# 3	m	l	o
# 4	l	n	L
# 5	n	.	n
# 댄스파티에는 위와 같이 세 종류의 학생이 있다.
#
# 학생들은 빈자리 없이 좌우로 딱 붙어 한 줄로 서서, 다음 차례가 되면 도약 준비 학생은 도약 중으로, 도약 중 학생은 도약 준비로 바뀐다. 착석 학생은 바뀌지 않는다.
#
# 당신은 댄스파티의 모습을 한 장의 사진에 담았다.
#
# 그리고 10년이 흐른 지금, 대학을 졸업하고 사회인이 된 당신은 짐을 정리하던 도중 댄스파티의 사진을 발견하였다. 그 낡은 단 한 장의 사진은 하루가 바쁘게 일상에 치이며 살아가는 당신을 추억에 잠기게 하기에 충분하였다.
#
# 그 시절을 회상하기 위해 주어진 사진을 토대로 다음 차례의 모습을 유추하라.

dance = []
for _ in range(5):
    dance.append(list(input()))

ready = [".", "o". "m", "l", "n"]
flying = ["o", "w", "l", "n", "."]

for i in range(5):
    for j in range(len(dance[i])):
        if dance[j][i] == ready[j]:
            dance[j][i] = flying[j]
        elif dance[j][i] == flying[j]:
            dance[j][i] = ready[j]