# 계단 오르기 게임은 계단 아래 시작점부터 계단 꼭대기에 위치한 도착점까지 가는 게임이다. <그림 1>과 같이 각각의 계단에는 일정한 점수가 쓰여 있는데 계단을 밟으면 그 계단에 쓰여 있는 점수를 얻게 된다.
#
# 예를 들어 <그림 2>와 같이 시작점에서부터 첫 번째, 두 번째, 네 번째, 여섯 번째 계단을 밟아 도착점에 도달하면 총 점수는 10 + 20 + 25 + 20 = 75점이 된다.
#
# 계단 오르는 데는 다음과 같은 규칙이 있다.
#
# 계단은 한 번에 한 계단씩 또는 두 계단씩 오를 수 있다. 즉, 한 계단을 밟으면서 이어서 다음 계단이나, 다음 다음 계단으로 오를 수 있다.
#
# 연속된 세 개의 계단을 모두 밟아서는 안 된다. 단, 시작점은 계단에 포함되지 않는다. 마지막 도착 계단은 반드시 밟아야 한다.
#
# 따라서 첫 번째 계단을 밟고 이어 두 번째 계단이나, 세 번째 계단으로 오를 수 있다. 하지만, 첫 번째 계단을 밟고 이어 네 번째 계단으로 올라가거나, 첫 번째, 두 번째, 세 번째 계단을 연속해서 모두 밟을 수는 없다.
#
# 각 계단에 쓰여 있는 점수가 주어질 때 이 게임에서 얻을 수 있는 총 점수의 최댓값을 구하는 프로그램을 작성하시오.

score = [0] * 300   # 각 계단에 쓰여 있는 점수를 저장한 배열
dp = [0] * 300  # 게임에서 얻을 수 있는 총 점수의 최댓값을 저장한 배열

stair = int(input())
for i in range(stair):
    score[i] = int(input())

dp[0] = score[0]    # 첫 번째 계단을 올랐을때 점수
dp[1] = score[0] + score[1] # 두 번째 계단까지 올랐을때 얻을 수 있는 점수의 최댓값
dp[2] = max(score[0] + score[2], score[1] + score[2])   # 세 번째 계단까지 올랐을때 얻을 수 있는 점수의 최댓값
for i in range(3, stair):
    # 예를 들어, 네 번째 계단에서 얻을 수 있는 점수의 최댓값 경우를 생각해보면 다음과 같다.
    # CASE1. 두 번째 계단까지 오른 후 두 계단을 올라 네 번째 계단에 도착했을때
    # CASE2. 첫 번째 계단까지 오른 후 두 계단을 올라 세 번째 계단에 닿고 그 다음 한 계단을 더 오르는 경우
    dp[i] = max(dp[i-2] + score[i], dp[i-3] + score[i-1] + score[i])
print(dp[stair-1])