# 도미노는 여러 종류의 타일 게임에서 사용하는 조각이다. 도미노 조각은 두 칸으로 이루어져 있다. 각 칸에는 점이 찍혀있는데, 점이 안 찍혀져 있을 수도 있다. 점의 개수는 세트의 크기에 의해서 결정된다. 세트의 크기가 N인 도미노 세트에서 점의 개수는 0보다 크거나 같고, N보다 작거나 같다. 두 도미노에 찍혀잇는 점의 개수가 같다면, 두 도미노는 동일한 것이다. 예를 들어, 점이 2개와 8개 찍혀있는 도미노는 8개와 2개 찍혀있는 도미노와 같은 도미노이다.

# 크기가 N인 도미노 세트는 N 또는 그보다 작거나 같은 점을 포함하는 가능한 도미노를 모두 포함하고 있고, 각 도미노는 중복되지 않는다. 다음은 크기가 2인 도미노 세트이다.

# N을 입력받은 뒤, 크기가 N인 도미노 세트에는 점이 몇 개 찍혀 있는지 구하는 프로그램을 작성하시오.

# 완전탐색 > n(n+1)(n+2) / 2 공식 활용도 기억할것

# 알고리즘의 해석(N = 2인 경우를 가정해보자)
# i = 0 > j = 0 > i + j = 0
# i = 1 > j = 0, 1 > i + j = 1 + 2 = 3
# i = 2 > j = 0, 1, 2 > i + j = 2 + 3 + 4 = 9
# sum = 0 + 3 + 9 = 12

N = int(input())

sum = 0
for i in range(0, N+1):
    for j in range(0, i+1):
        sum += i + j
print(sum)